docs/evidence/perf/sweep-win-repeat-10.txt

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 


     execution: local
        script: /perf/load.js
        output: -

     scenarios: (100.00%) 2 scenarios, 55 max VUs, 1m40s max duration (incl. graceful stop):
              * warmup: 5 looping VUs for 20s (exec: traffic, gracefulStop: 30s)
              * measure: 50 looping VUs for 45s (exec: traffic, startTime: 25s, gracefulStop: 30s)


Run       [ 100% ] setup()
warmup    [   0% ]
measure   [   0% ]

Run       [ 100% ] setup()
warmup    [   0% ]
measure   [   0% ]

Run       [ 100% ] setup()
warmup    [   0% ]
measure   [   0% ]

Run       [ 100% ] setup()
warmup    [   0% ]
measure   [   0% ]

Run       [ 100% ] setup()
warmup    [   0% ]
measure   [   0% ]

Run       [ 100% ] setup()
warmup    [   0% ]
measure   [   0% ]

running (0m07.0s), 05/55 VUs, 5 complete and 0 interrupted iterations
warmup    [   2% ] 5 VUs    00.4s/20s
measure • [   0% ] waiting  24.6s

running (0m08.0s), 05/55 VUs, 35 complete and 0 interrupted iterations
warmup    [   7% ] 5 VUs    01.4s/20s
measure • [   0% ] waiting  23.6s

running (0m09.0s), 05/55 VUs, 75 complete and 0 interrupted iterations
warmup    [  12% ] 5 VUs    02.4s/20s
measure • [   0% ] waiting  22.6s

running (0m10.0s), 05/55 VUs, 110 complete and 0 interrupted iterations
warmup    [  17% ] 5 VUs    03.4s/20s
measure • [   0% ] waiting  21.6s

running (0m11.0s), 05/55 VUs, 150 complete and 0 interrupted iterations
warmup    [  22% ] 5 VUs    04.4s/20s
measure • [   0% ] waiting  20.6s

running (0m12.0s), 05/55 VUs, 190 complete and 0 interrupted iterations
warmup    [  27% ] 5 VUs    05.4s/20s
measure • [   0% ] waiting  19.6s

running (0m13.0s), 05/55 VUs, 232 complete and 0 interrupted iterations
warmup    [  32% ] 5 VUs    06.4s/20s
measure • [   0% ] waiting  18.6s

running (0m14.0s), 05/55 VUs, 275 complete and 0 interrupted iterations
warmup    [  37% ] 5 VUs    07.4s/20s
measure • [   0% ] waiting  17.6s

running (0m15.0s), 05/55 VUs, 317 complete and 0 interrupted iterations
warmup    [  42% ] 5 VUs    08.4s/20s
measure • [   0% ] waiting  16.6s

running (0m16.0s), 05/55 VUs, 360 complete and 0 interrupted iterations
warmup    [  47% ] 5 VUs    09.4s/20s
measure • [   0% ] waiting  15.6s

running (0m17.0s), 05/55 VUs, 402 complete and 0 interrupted iterations
warmup    [  52% ] 5 VUs    10.4s/20s
measure • [   0% ] waiting  14.6s

running (0m18.0s), 05/55 VUs, 447 complete and 0 interrupted iterations
warmup    [  57% ] 5 VUs    11.4s/20s
measure • [   0% ] waiting  13.6s

running (0m19.0s), 05/55 VUs, 488 complete and 0 interrupted iterations
warmup    [  62% ] 5 VUs    12.4s/20s
measure • [   0% ] waiting  12.6s

running (0m20.0s), 05/55 VUs, 532 complete and 0 interrupted iterations
warmup    [  67% ] 5 VUs    13.4s/20s
measure • [   0% ] waiting  11.6s

running (0m21.0s), 05/55 VUs, 577 complete and 0 interrupted iterations
warmup    [  72% ] 5 VUs    14.4s/20s
measure • [   0% ] waiting  10.6s

running (0m22.0s), 05/55 VUs, 617 complete and 0 interrupted iterations
warmup    [  77% ] 5 VUs    15.4s/20s
measure • [   0% ] waiting  09.6s

running (0m23.0s), 05/55 VUs, 662 complete and 0 interrupted iterations
warmup    [  82% ] 5 VUs    16.4s/20s
measure • [   0% ] waiting  08.6s

running (0m24.0s), 05/55 VUs, 703 complete and 0 interrupted iterations
warmup    [  87% ] 5 VUs    17.4s/20s
measure • [   0% ] waiting  07.6s

running (0m25.0s), 05/55 VUs, 747 complete and 0 interrupted iterations
warmup    [  92% ] 5 VUs    18.4s/20s
measure • [   0% ] waiting  06.6s

running (0m26.0s), 05/55 VUs, 792 complete and 0 interrupted iterations
warmup    [  97% ] 5 VUs    19.4s/20s
measure • [   0% ] waiting  05.6s

running (0m27.0s), 00/55 VUs, 822 complete and 0 interrupted iterations
warmup  ✓ [ 100% ] 5 VUs    20s
measure • [   0% ] waiting  04.6s

running (0m28.0s), 00/55 VUs, 822 complete and 0 interrupted iterations
warmup  ✓ [ 100% ] 5 VUs    20s
measure • [   0% ] waiting  03.6s

running (0m29.0s), 00/55 VUs, 822 complete and 0 interrupted iterations
warmup  ✓ [ 100% ] 5 VUs    20s
measure • [   0% ] waiting  02.6s

running (0m30.0s), 00/55 VUs, 822 complete and 0 interrupted iterations
warmup  ✓ [ 100% ] 5 VUs    20s
measure • [   0% ] waiting  01.6s

running (0m31.0s), 00/55 VUs, 822 complete and 0 interrupted iterations
warmup  ✓ [ 100% ] 5 VUs    20s
measure • [   0% ] waiting  00.6s

running (0m32.0s), 50/55 VUs, 886 complete and 0 interrupted iterations
warmup  ✓ [ 100% ] 5 VUs   20s
measure   [   1% ] 50 VUs  00.4s/45s

running (0m33.0s), 50/55 VUs, 1236 complete and 0 interrupted iterations
warmup  ✓ [ 100% ] 5 VUs   20s
measure   [   3% ] 50 VUs  01.4s/45s

running (0m34.0s), 50/55 VUs, 1559 complete and 0 interrupted iterations
warmup  ✓ [ 100% ] 5 VUs   20s
measure   [   5% ] 50 VUs  02.4s/45s

running (0m35.0s), 50/55 VUs, 1921 complete and 0 interrupted iterations
warmup  ✓ [ 100% ] 5 VUs   20s
measure   [   8% ] 50 VUs  03.4s/45s

running (0m36.0s), 50/55 VUs, 2257 complete and 0 interrupted iterations
warmup  ✓ [ 100% ] 5 VUs   20s
measure   [  10% ] 50 VUs  04.4s/45s

running (0m37.0s), 50/55 VUs, 2617 complete and 0 interrupted iterations
warmup  ✓ [ 100% ] 5 VUs   20s
measure   [  12% ] 50 VUs  05.4s/45s

running (0m38.0s), 50/55 VUs, 3015 complete and 0 interrupted iterations
warmup  ✓ [ 100% ] 5 VUs   20s
measure   [  14% ] 50 VUs  06.4s/45s

running (0m39.0s), 50/55 VUs, 3376 complete and 0 interrupted iterations
warmup  ✓ [ 100% ] 5 VUs   20s
measure   [  16% ] 50 VUs  07.4s/45s

running (0m40.0s), 50/55 VUs, 3718 complete and 0 interrupted iterations
warmup  ✓ [ 100% ] 5 VUs   20s
measure   [  19% ] 50 VUs  08.4s/45s

running (0m41.0s), 50/55 VUs, 4122 complete and 0 interrupted iterations
warmup  ✓ [ 100% ] 5 VUs   20s
measure   [  21% ] 50 VUs  09.4s/45s

running (0m42.0s), 50/55 VUs, 4550 complete and 0 interrupted iterations
warmup  ✓ [ 100% ] 5 VUs   20s
measure   [  23% ] 50 VUs  10.4s/45s

running (0m43.0s), 50/55 VUs, 4987 complete and 0 interrupted iterations
warmup  ✓ [ 100% ] 5 VUs   20s
measure   [  25% ] 50 VUs  11.4s/45s

running (0m44.0s), 50/55 VUs, 5406 complete and 0 interrupted iterations
warmup  ✓ [ 100% ] 5 VUs   20s
measure   [  28% ] 50 VUs  12.4s/45s

running (0m45.0s), 50/55 VUs, 5845 complete and 0 interrupted iterations
warmup  ✓ [ 100% ] 5 VUs   20s
measure   [  30% ] 50 VUs  13.4s/45s

running (0m46.0s), 50/55 VUs, 6277 complete and 0 interrupted iterations
warmup  ✓ [ 100% ] 5 VUs   20s
measure   [  32% ] 50 VUs  14.4s/45s

running (0m47.0s), 50/55 VUs, 6698 complete and 0 interrupted iterations
warmup  ✓ [ 100% ] 5 VUs   20s
measure   [  34% ] 50 VUs  15.4s/45s

running (0m48.0s), 50/55 VUs, 7149 complete and 0 interrupted iterations
warmup  ✓ [ 100% ] 5 VUs   20s
measure   [  36% ] 50 VUs  16.4s/45s

running (0m49.0s), 50/55 VUs, 7598 complete and 0 interrupted iterations
warmup  ✓ [ 100% ] 5 VUs   20s
measure   [  39% ] 50 VUs  17.4s/45s

running (0m50.0s), 50/55 VUs, 8028 complete and 0 interrupted iterations
warmup  ✓ [ 100% ] 5 VUs   20s
measure   [  41% ] 50 VUs  18.4s/45s

running (0m51.0s), 50/55 VUs, 8438 complete and 0 interrupted iterations
warmup  ✓ [ 100% ] 5 VUs   20s
measure   [  43% ] 50 VUs  19.4s/45s

running (0m52.0s), 50/55 VUs, 8704 complete and 0 interrupted iterations
warmup  ✓ [ 100% ] 5 VUs   20s
measure   [  45% ] 50 VUs  20.4s/45s

running (0m53.0s), 50/55 VUs, 9086 complete and 0 interrupted iterations
warmup  ✓ [ 100% ] 5 VUs   20s
measure   [  48% ] 50 VUs  21.4s/45s

running (0m54.0s), 50/55 VUs, 9522 complete and 0 interrupted iterations
warmup  ✓ [ 100% ] 5 VUs   20s
measure   [  50% ] 50 VUs  22.4s/45s

running (0m55.0s), 50/55 VUs, 9963 complete and 0 interrupted iterations
warmup  ✓ [ 100% ] 5 VUs   20s
measure   [  52% ] 50 VUs  23.4s/45s

running (0m56.0s), 50/55 VUs, 10398 complete and 0 interrupted iterations
warmup  ✓ [ 100% ] 5 VUs   20s
measure   [  54% ] 50 VUs  24.4s/45s

running (0m57.0s), 50/55 VUs, 10846 complete and 0 interrupted iterations
warmup  ✓ [ 100% ] 5 VUs   20s
measure   [  56% ] 50 VUs  25.4s/45s

running (0m58.0s), 50/55 VUs, 11287 complete and 0 interrupted iterations
warmup  ✓ [ 100% ] 5 VUs   20s
measure   [  59% ] 50 VUs  26.4s/45s

running (0m59.0s), 50/55 VUs, 11730 complete and 0 interrupted iterations
warmup  ✓ [ 100% ] 5 VUs   20s
measure   [  61% ] 50 VUs  27.4s/45s

running (1m00.0s), 50/55 VUs, 12162 complete and 0 interrupted iterations
warmup  ✓ [ 100% ] 5 VUs   20s
measure   [  63% ] 50 VUs  28.4s/45s

running (1m01.0s), 50/55 VUs, 12526 complete and 0 interrupted iterations
warmup  ✓ [ 100% ] 5 VUs   20s
measure   [  65% ] 50 VUs  29.4s/45s

running (1m02.0s), 50/55 VUs, 12966 complete and 0 interrupted iterations
warmup  ✓ [ 100% ] 5 VUs   20s
measure   [  68% ] 50 VUs  30.4s/45s

running (1m03.0s), 50/55 VUs, 13396 complete and 0 interrupted iterations
warmup  ✓ [ 100% ] 5 VUs   20s
measure   [  70% ] 50 VUs  31.4s/45s

running (1m04.0s), 50/55 VUs, 13834 complete and 0 interrupted iterations
warmup  ✓ [ 100% ] 5 VUs   20s
measure   [  72% ] 50 VUs  32.4s/45s

running (1m05.0s), 50/55 VUs, 14279 complete and 0 interrupted iterations
warmup  ✓ [ 100% ] 5 VUs   20s
measure   [  74% ] 50 VUs  33.4s/45s

running (1m06.0s), 50/55 VUs, 14730 complete and 0 interrupted iterations
warmup  ✓ [ 100% ] 5 VUs   20s
measure   [  76% ] 50 VUs  34.4s/45s

running (1m07.0s), 50/55 VUs, 15168 complete and 0 interrupted iterations
warmup  ✓ [ 100% ] 5 VUs   20s
measure   [  79% ] 50 VUs  35.4s/45s

running (1m08.0s), 50/55 VUs, 15618 complete and 0 interrupted iterations
warmup  ✓ [ 100% ] 5 VUs   20s
measure   [  81% ] 50 VUs  36.4s/45s

running (1m09.0s), 50/55 VUs, 16055 complete and 0 interrupted iterations
warmup  ✓ [ 100% ] 5 VUs   20s
measure   [  83% ] 50 VUs  37.4s/45s

running (1m10.0s), 50/55 VUs, 16495 complete and 0 interrupted iterations
warmup  ✓ [ 100% ] 5 VUs   20s
measure   [  85% ] 50 VUs  38.4s/45s

running (1m11.0s), 50/55 VUs, 16934 complete and 0 interrupted iterations
warmup  ✓ [ 100% ] 5 VUs   20s
measure   [  88% ] 50 VUs  39.4s/45s

running (1m12.0s), 50/55 VUs, 17382 complete and 0 interrupted iterations
warmup  ✓ [ 100% ] 5 VUs   20s
measure   [  90% ] 50 VUs  40.4s/45s

running (1m13.0s), 50/55 VUs, 17818 complete and 0 interrupted iterations
warmup  ✓ [ 100% ] 5 VUs   20s
measure   [  92% ] 50 VUs  41.4s/45s

running (1m14.0s), 50/55 VUs, 18257 complete and 0 interrupted iterations
warmup  ✓ [ 100% ] 5 VUs   20s
measure   [  94% ] 50 VUs  42.4s/45s

running (1m15.0s), 50/55 VUs, 18702 complete and 0 interrupted iterations
warmup  ✓ [ 100% ] 5 VUs   20s
measure   [  96% ] 50 VUs  43.4s/45s

running (1m16.0s), 50/55 VUs, 19044 complete and 0 interrupted iterations
warmup  ✓ [ 100% ] 5 VUs   20s
measure   [  99% ] 50 VUs  44.4s/45s


  █ THRESHOLDS 

    checks{phase:measure}
    ✓ 'rate>0.99' rate=100.00%

    http_req_duration{phase:measure}
    ✓ 'p(95)<500' p(95)=15.4ms

    http_req_failed{phase:measure}
    ✓ 'rate<0.01' rate=0.98%


  █ TOTAL RESULTS 

    checks_total.......: 154776  2018.610985/s
    checks_succeeded...: 100.00% 154776 out of 154776
    checks_failed......: 0.00%   0 out of 154776

    ✓ list 200
    ✓ list 비어있지 않음
    ✓ orders 200
    ✓ orders 인증됨
    ✓ orders 최소 건수
    ✓ order 처리됨

    CUSTOM
    resp_2xx.......................: 76761 1001.128068/s
    resp_409_conflict..............: 727   9.481639/s
    resp_error_coded...............: 727   9.481639/s
    setup_requests.................: 100   1.304214/s

    HTTP
    http_req_duration..............: avg=5.15ms   min=45.4µs   med=2.95ms   p(95)=15.37ms  p(99)=34.57ms  max=436.53ms
      { expected_response:true }...: avg=5.11ms   min=45.4µs   med=2.91ms   p(95)=15.29ms  p(99)=34.27ms  max=436.53ms
      { phase:measure }............: avg=5.06ms   min=45.4µs   med=2.88ms   p(95)=15.4ms   p(99)=33.22ms  max=198.43ms
    http_req_failed................: 0.93% 727 out of 77488
      { phase:measure }............: 0.98% 727 out of 74100
    http_reqs......................: 77488 1010.609707/s

    EXECUTION
    iteration_duration.............: avg=121.58ms min=107.55ms med=114.15ms p(95)=159.88ms p(99)=224.08ms max=359.75ms
    iterations.....................: 19347 252.326373/s
    vus............................: 50    min=0            max=50
    vus_max........................: 55    min=55           max=55

    NETWORK
    data_received..................: 81 MB 1.1 MB/s
    data_sent......................: 16 MB 214 kB/s



running (1m16.7s), 00/55 VUs, 19347 complete and 0 interrupted iterations
warmup  ✓ [ 100% ] 5 VUs   20s
measure ✓ [ 100% ] 50 VUs  45s